export const ErrorLabels = {
  firstName: {
    DifferentAlphabets: 'Имя не может содержать символы кириллицы и латиницы одновременно',
    HyphenInBeginOrEnd: 'Дефис не может находится в начале, либо конце имени',
    PartHaveIncorrectUppercase: 'Заглавная буква должна быть в начале части имени и только одна',
    AllHaveIncorrectUppercase: 'Заглавная буква должна быть в начале имени и только одна',
    NotValidSymbols: 'Имя может содержать только заглавные, строчные буквы, либо дефис',
  },
  lastName: {
    DifferentAlphabets: 'Фамилия не может содержать символы кириллицы и латиницы одновременно',
    HyphenInBeginOrEnd: 'Дефис не может находится в начале, либо конце фамилии',
    PartHaveIncorrectUppercase: 'Заглавная буква должна быть в начале части фамилии и только одна',
    AllHaveIncorrectUppercase: 'Заглавная буква должна быть в начале фамилии и только одна',
    NotValidSymbols: 'Фамилия может содержать только заглавные, строчные буквы, либо дефис',
  },
  patronymic: {
    DifferentAlphabets: 'Отчество не может содержать символы кириллицы и латиницы одновременно',
    HyphenInBeginOrEnd: 'Отчество не может находится в начале, либо конце фамилии',
    PartHaveIncorrectUppercase: 'Заглавная буква должна быть в начале части отчества и только одна',
    AllHaveIncorrectUppercase: 'Заглавная буква должна быть в начале отчества и только одна',
    NotValidSymbols: 'Отчество может содержать только заглавные, строчные буквы, либо дефис',
  },
};
